---
type: STLExportOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 18
tags: [revit-api, class]
---

# STLExportOptions

`Autodesk.Revit.DB.STLExportOptions` · Revit 2024 · 18 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | STLExportOptions | — | `` |
| Constructor | STLExportOptions | 2021.1 | `public STLExportOptions ()` |
| Method | IsGridAspectRatioSet | 2021.1 | `public bool IsGridAspectRatioSet ()` |
| Method | IsMaxEdgeLengthSet | 2021.1 | `public bool IsMaxEdgeLengthSet ()` |
| Method | IsNormalToleranceSet | 2021.1 | `public bool IsNormalToleranceSet ()` |
| Method | IsSurfaceToleranceSet | 2021.1 | `public bool IsSurfaceToleranceSet ()` |
| Method | IsValidForGridAspectRatio | 2021.1 | `public static bool IsValidForGridAspectRatio ( double value )` |
| Method | IsValidForMaxEdgeLength | 2021.1 | `public static bool IsValidForMaxEdgeLength ( double value )` |
| Method | IsValidForNormalTolerance | 2021.1 | `public static bool IsValidForNormalTolerance ( double value )` |
| Method | IsValidForSurfaceTolerance | 2021.1 | `public static bool IsValidForSurfaceTolerance ( double value )` |
| Method | SetTessellationSettings | 2021.1 | `public void SetTessellationSettings ( ExportResolution resolutionType )` |
| Property | ExportBinary | 2021.1 | `public bool ExportBinary { get ; set ; }` |
| Property | ExportColor | 2021.1 | `public bool ExportColor { get ; set ; }` |
| Property | GridAspectRatio | 2021.1 | `public double GridAspectRatio { get ; set ; }` |
| Property | MaxEdgeLength | 2021.1 | `public double MaxEdgeLength { get ; set ; }` |
| Property | NormalTolerance | 2021.1 | `public double NormalTolerance { get ; set ; }` |
| Property | SurfaceTolerance | 2021.1 | `public double SurfaceTolerance { get ; set ; }` |
| Property | TargetUnit | 2021.1 | `public ExportUnit TargetUnit { get ; set ; }` |